from tasks import add, divide


r=add.delay(130,20)
# #زمانی که بخواهیم، تسکی را با زمانبندی اجرا کنیم، از متد
# #زیر استفاده می کنیم
# add.apply_async([4,65])


#timeout
#این آرگمان بر حسب ثانیه می باشد، و اگر تنطیم شود ونتیجه بعد از آن حاصل شود 
#دیگر استفاده نخواهد شد
print(r.get())

r=divide.delay(4,1)
# #آرگمان زیر خطایی که در تسک رخ می دهد را رد می شود
print(r.get(propagate=False))
# #خط زیر خطایی که در تسک رخ داده را نمایش می دهد
print(r.traceback)

# t=add.delay(3,4)
# print(t.get(propagate=False))


# divide.delay(20,4)
# #زمانی که بک اندی برای سلری ست می شود، خروجی های تسک ها در
# #آن ذخیره می شود، برای اینکه این خروجی ها بک اند را پر نکند، یا باید از
# #get()
# #استفاده شود و یا باید از  دستور
# #forget()
# #استفاده شود تا این خروجی ها بعد از تمام شدن کار تسک از بین بروند
# r.forget()





print('finished')




